MJmj-kim/Project_ADXL345_NRF52/Segger Example/examples/peripheral/twi_sensor/main.c
/**
 * Copyright (c) 2015 - 2018, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
/** @file
 * @defgroup tw_sensor_example main.c
 * @{
 * @ingroup nrf_twi_example
 * @brief TWI Sensor Example main file.
 *
 * This file contains the source code for a sample application using TWI.
 *
 */

#include <stdio.h>
#include "boards.h"
#include "app_util_platform.h"
#include "app_error.h"
#include "nrf_drv_twi.h"
#include "nrf_delay.h"

#include "ADXL345.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"


/*speaker header*/
#include "nrf_pwm_audio.h"
        
#include "app_util_platform.h"
#include "app_timer.h"

#include "nrf_drv_clock.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#include "attention.h"






/* TWI instance ID. */
static const nrf_drv_twi_t m_twi = NRF_DRV_TWI_INSTANCE(TWI_INSTANCE_ID);


/**
 * @brief UART initialization.
 */
void twi_init (void)
{
    ret_code_t err_code;

    const nrf_drv_twi_config_t twi_ADXL345_config = {
       .scl                = ARDUINO_SCL_PIN,
       .sda                = ARDUINO_SDA_PIN,
       .frequency          = NRF_DRV_TWI_FREQ_100K,
       .interrupt_priority = APP_IRQ_PRIORITY_HIGH,
       .clear_bus_init     = false
    };

    err_code = nrf_drv_twi_init(&m_twi, &twi_ADXL345_config, NULL, NULL);
    APP_ERROR_CHECK(err_code);

    nrf_drv_twi_enable(&m_twi);
}



/**
 * @brief Function for main application entry.
 */

void ADXL345_set_mode(void);


int main(void)
{
    
    
    APP_ERROR_CHECK(NRF_LOG_INIT(NULL));
    NRF_LOG_DEFAULT_BACKENDS_INIT();


   //--------------------------  AUDIO SETTING -----------------------------
     nrf_drv_clock_init();
    
     
     nrf_drv_clock_lfclk_request(NULL);
     app_timer_init();


     uint8_t const pwm_audio_pin   = 3;        ///< GPIO pin to use for output
     bool const pwm_audio_highdrive= false;    ///< whether to use GPIO pin in highdrive mode to increase volume

     nrf_pwm_audio_init(pwm_audio_pin, pwm_audio_highdrive);   
  //--------------------------  AUDIO SETTING -----------------------------
   

   
    printf("\r\nTWI Accelerometer example started\n");
   
    NRF_LOG_FLUSH();
    twi_init();
    ADXL345_set_mode();
    ADXL345_I2C_Set_DATAX0();

   
    printf("---------------------------------\n\n\n");
    while (true)
    {
        nrf_delay_ms(100);

        double xyz[3];
	double ax,ay,az;
        ax = xyz[0];
	ay = xyz[1];
	az = xyz[2];
        ADXL345_Get_Acceleration(xyz);
        
        printf("X = %lf \n", ax);
        printf("Y = %lf \n", ay);
        printf("Z = %lf \n", az);

         if(ay > 0.5)
         {
          nrf_pwm_audio_playback(attention_raw, sizeof(attention_raw), NRF_PWM_AUDIO_SAMPLERATE_16K, 1.0, 0);

          // wait for playback to end
          
          
          while (nrf_pwm_audio_is_playing()) { __WFE(); NRF_LOG_FLUSH(); }          
          
          /*

          // loop for eternity (but in the meantime, button presses will be evaluated)          
          while (1) { __WFE(); NRF_LOG_FLUSH(); } 
          
          // uninitialize PWM audio module (we will never reach this line in this program)
          nrf_pwm_audio_destroy();  
          
          */
         } 
  
        NRF_LOG_FLUSH();       
    }    
}


void ADXL345_set_mode(void)
{ 


    ret_code_t err_code;
    err_code = ADXL345_I2C_Normal_Mode(&m_twi);
    APP_ERROR_CHECK(err_code);


    ADXL345_I2C_Sleep_Mode();    

    ADXL345_I2C_Init_Measure_Mode();
         
    
    ADXL345_I2C_Inactivity_Threshold(75);
    ADXL345_I2C_Activity_Threshold(75);
    

    ADXL345_I2C_Set_Format();

    
}

